# Source: https://www.forbes.com/billionaires/

In [5]:
import pandas as pd

df = pd.read_csv('forbes_2022_billionaires.csv')
df.head(1)

,rank,personName,age,finalWorth,year,month,category,source,country,state,...,organization,selfMade,gender,birthDate,title,philanthropyScore,residenceMsa,numberOfSiblings,bio,about
0,1,Elon Musk,50.0,219000.0,2022,4,Automotive,"Tesla, SpaceX",United States,Texas,...,Tesla,True,M,1971-06-28,CEO,1.0,NaN,NaN,Elon Musk is working to revolutionize transpor...,Musk was accepted to a graduate program at Sta...

In [6]:
df.shape[0]

2668

# What is the wealth of every single person on this list?

In [15]:
df['finalWorth'].sum()*1000000

12705950000000.0

## -- Answer 12,705,950,000,000 (trillion) --

# Q1: Who is the richest man from each country?

In [ ]:
df.groupby('country')

# Q2: How many billionaires are in each country?